# BuiltInFailures.SystemsFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures Class
BuiltInFailures Class Members See Also
---
Failures about System.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SystemsFailures
```

Visual Basic
---
```text
Public NotInheritable Class SystemsFailures
```

Visual C++
---
```text
public ref class SystemsFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SystemsFailures
# See Also
BuiltInFailures..::..SystemsFailures Members
Autodesk.Revit.DB Namespace